In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib as mpl

%matplotlib inline

In [2]:
df1 = pd.DataFrame({'Column1': [11, 12, 13], 'Column2': [21, 22, 23]})
df1

   Column1  Column2
0       11       21
1       12       22
2       13       23

In [3]:
df2 = pd.DataFrame({'Column3': [101], 'Column4': [102]})
df2

   Column3  Column4
0      101      102

In [4]:
df3 = pd.concat([df1, df2], axis=1)
df3

   Column1  Column2  Column3  Column4
0       11       21    101.0    102.0
1       12       22      NaN      NaN
2       13       23      NaN      NaN

In [5]:
df2_dct = df2.to_dict(orient='records')[0]
df2_dct

{'Column3': 101, 'Column4': 102}

In [6]:
df3.fillna(df2_dct, inplace=True)
df3

   Column1  Column2  Column3  Column4
0       11       21    101.0    102.0
1       12       22    101.0    102.0
2       13       23    101.0    102.0